RomanLut/hx-esp32-cam-fpv/components/esp32-camera/driver/cam_hal.c
// Copyright 2010-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdio.h>
#include <string.h>
#include <stdalign.h>
#include "esp_heap_caps.h"
#include "ll_cam.h"
#include "cam_hal.h"

#if (ESP_IDF_VERSION_MAJOR == 3) && (ESP_IDF_VERSION_MINOR == 3)
#include "rom/ets_sys.h"
#else
#include "esp_timer.h"
#if CONFIG_IDF_TARGET_ESP32
#include "esp32/rom/ets_sys.h"  // will be removed in idf v5.0
#elif CONFIG_IDF_TARGET_ESP32S2
#include "esp32s2/rom/ets_sys.h"
#elif CONFIG_IDF_TARGET_ESP32S3
#include "esp32s3/rom/ets_sys.h"
#elif CONFIG_IDF_TARGET_ESP32C5
#include "esp32c5/rom/ets_sys.h"
#endif
#endif // ESP_IDF_VERSION_MAJOR
#define ESP_CAMERA_ETS_PRINTF ets_printf

#if CONFIG_CAMERA_TASK_STACK_SIZE
#define CAM_TASK_STACK             CONFIG_CAMERA_TASK_STACK_SIZE
#else
#define CAM_TASK_STACK             (2*1024)
#endif

static const char *TAG = "cam_hal";
static cam_obj_t *cam_obj = NULL;

static bool s_ovf_flag = false;

//static const uint32_t JPEG_SOI_MARKER = 0xFFD8FF;  // written in little-endian for esp32
//static const uint16_t JPEG_EOI_MARKER = 0xD9FF;  // written in little-endian for esp32
size_t (*data_available_callback)(void * cam_obj,const uint8_t* data, size_t count, bool last);

#if !defined(CONFIG_IDF_TARGET_ESP32C5)

/*
static int cam_verify_jpeg_eoi(const uint8_t *inbuf, uint32_t length)
{
    int offset = -1;
    uint8_t *dptr = (uint8_t *)inbuf + length - 2;
    while (dptr > inbuf) {
        if (memcmp(dptr, &JPEG_EOI_MARKER, 2) == 0) {
            offset = dptr - inbuf;
            //ESP_LOGW(TAG, "EOI: %d", length - (offset + 2));
            return offset;
        }
        dptr--;
    }
    return -1;
}
*/

static bool cam_get_next_frame(int * frame_pos)
{
    if(!cam_obj->frames[*frame_pos].en){
        for (int x = 0; x < cam_obj->frame_cnt; x++) {
            if (cam_obj->frames[x].en) {
                *frame_pos = x;
                return true;
            }
        }
    } else {
        return true;
    }
    return false;
}

static bool cam_start_frame(int * frame_pos)
{
    if (cam_get_next_frame(frame_pos)) {
        if(ll_cam_start(cam_obj, *frame_pos)){
            // Vsync the frame manually
            ll_cam_do_vsync(cam_obj);
            uint64_t us = (uint64_t)esp_timer_get_time();
            cam_obj->frames[*frame_pos].fb.timestamp.tv_sec = us / 1000000UL;
            cam_obj->frames[*frame_pos].fb.timestamp.tv_usec = us % 1000000UL;
            return true;
        }
    }
    return false;
}

#endif  //!defined(CONFIG_IDF_TARGET_ESP32C5)

void IRAM_ATTR ll_cam_send_event(cam_obj_t *cam, cam_event_t* cam_event, BaseType_t * HPTaskAwoken)
{
    if (xQueueSendFromISR(cam->event_queue, (void *)cam_event, HPTaskAwoken) != pdTRUE) {
        ll_cam_stop(cam);
        cam->state = CAM_STATE_IDLE;
        ESP_CAMERA_ETS_PRINTF(DRAM_STR("cam_hal: EV-%s-OVF\r\n"), cam_event->kind==CAM_PARLIO_DATA ? DRAM_STR("PARLIO") : cam_event->kind==CAM_IN_SUC_EOF_EVENT ? DRAM_STR("EOF") : DRAM_STR("VSYNC"));
        s_ovf_flag = true;
    }
}

volatile int pk2 = 0;

#if CONFIG_IDF_TARGET_ESP32C5

#define MAX_FRAME_SIZE (500*1024)

//-------------------------------------------------------------------------------------
static void cam_task(void *arg)
{
    static uint8_t lastByte = 0;
    static uint8_t byteFF = 0xff;
    static uint32_t frameSize = 0;

    cam_obj->state = CAM_STATE_IDLE;
    xQueueReset(cam_obj->event_queue);

    while (1) 
    {
        cam_event_t cam_event;
        xQueueReceive(cam_obj->event_queue, (void *)&cam_event, portMAX_DELAY);
        //the only possible event type is cam_event.kind == CAM_PARLIO_DATA) 

//#ifdef PROFILE_CAMERA_DATA    
//        s_profiler.set(PF_PARLIO_DATA, 1);
//#endif

        const uint8_t* pData = cam_event.data;
        uint32_t availBytes = cam_event.length;

        while ( availBytes > 0 )
        {
            if ( cam_obj->state == CAM_STATE_IDLE ) 
            {
                while ( availBytes > 0 )
                {
                    const uint8_t b = *pData;
                    if ( ( b == 0xd8) && (lastByte == 0xff) )
                    {
                        lastByte = 0;
                        cam_obj->state = CAM_STATE_READ_BUF;
                        data_available_callback((void *)cam_obj,0,0,0); //start frame

                        if ( pData == cam_event.data)
                        {
                            //frame started in the prev block
                            //pass 0xff explicitly
                            data_available_callback((void *)cam_obj, &byteFF, 1, false);
                            frameSize = 1;
                        }
                        else
                        {
                            //point to 0xff 0xd8
                            pData--;
                            availBytes++;
                            frameSize = 0;
                        }
                        break;
                    }
                    lastByte = b;
                    pData++;
                    availBytes--;
                }
            }

            if ((cam_obj->state == CAM_STATE_READ_BUF) && (availBytes > 0))
            {
                uint32_t frameBytes = availBytes;

                //look for end of frame in the buffer
                const uint8_t* pData2 = pData;
                uint32_t availBytes2 = availBytes;

                //REVIEW: can free few CPU cycles by skipping search in the first 512 bytes of frame

